In [1]:
import numpy as np
import pandas as pd

In [11]:
df = pd.read_csv('C:/Users/Satyam/Downloads/CAR DETAILS FROM CAR DEKHO.csv')

In [12]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [5]:
# analyse the data according to the question.

# 1. try to get atleast 6 the sample of this data.

# 2. find top 10 cars having highest selling price.

# 3. find bottom 1 cars having lowest selling price.

# 4. which owner owns 'Toyota Innova 2.5 VX (Diesel) 8 Seater BS IV' .

# 5. according to selling price of top 10 car tell the transmission of the car.

# 6. tell me the year of the car in which transmission is manual.

In [6]:
df.sample(6)

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
2961,Mahindra Scorpio VLS 2.2 mHawk,2008,300000,270000,Diesel,Individual,Manual,Third Owner
1342,Maruti Wagon R VXI BS IV with ABS,2015,229999,100000,Petrol,Individual,Manual,Third Owner
3991,Chevrolet Beat LS,2016,250000,70000,Petrol,Individual,Manual,Third Owner
2214,Ford Figo Diesel Titanium,2010,160000,102307,Diesel,Dealer,Manual,First Owner
866,Hyundai i20 1.2 Spotz,2017,400000,50000,Petrol,Individual,Manual,First Owner
1747,Maruti Swift Dzire VDI,2013,525000,37000,Diesel,Dealer,Manual,First Owner

In [8]:
#  find top 10 cars having highest selling price.

highest_price  = df['selling_price'].max()

In [9]:
highest_price

8900000

In [15]:
df['name'].head(10)

0                Maruti 800 AC
1     Maruti Wagon R LXI Minor
2         Hyundai Verna 1.6 SX
3       Datsun RediGO T Option
4        Honda Amaze VX i-DTEC
5         Maruti Alto LX BSIII
6    Hyundai Xcent 1.2 Kappa S
7     Tata Indigo Grand Petrol
8     Hyundai Creta 1.6 VTVT S
9     Maruti Celerio Green VXI
Name: name, dtype: object

In [17]:
df[['selling_price','name']]

      selling_price                                 name
0             60000                        Maruti 800 AC
1            135000             Maruti Wagon R LXI Minor
2            600000                 Hyundai Verna 1.6 SX
3            250000               Datsun RediGO T Option
4            450000                Honda Amaze VX i-DTEC
...             ...                                  ...
4335         409999  Hyundai i20 Magna 1.4 CRDi (Diesel)
4336         409999           Hyundai i20 Magna 1.4 CRDi
4337         110000                  Maruti 800 AC BSIII
4338         865000     Hyundai Creta 1.6 CRDi SX Option
4339         225000                     Renault KWID RXT

[4340 rows x 2 columns]

In [25]:
df[df['selling_price'] == df['selling_price'].max()][['name','selling_price']]

                                          name  selling_price
3872  Audi RS7 2015-2019 Sportback Performance        8900000

In [29]:
x = df['selling_price'].max()

In [31]:
x

8900000

In [35]:
#  find bottom 1 cars having lowest selling price.
df[df['selling_price'] == df['selling_price'].min()][['name','selling_price']]

                       name  selling_price
2662  Ford Ikon 1.6 ZXI NXt          20000

In [36]:
df.columns

Index(['name', 'year', 'selling_price', 'km_driven', 'fuel', 'seller_type',
       'transmission', 'owner'],
      dtype='object')

In [43]:
df[df['name'] ==  'Toyota Innova 2.5 VX (Diesel) 8 Seater BS IV'][['name','owner','selling_price','transmission']]

,name,owner,selling_price,transmission
4334,Toyota Innova 2.5 VX (Diesel) 8 Seater BS IV,First Owner,600000,Manual

In [44]:
#  according to selling price of top 1 car tell the transmission of the car.

In [46]:
df[df['selling_price'] == df['selling_price'].max()][['name','transmission']]

                                          name transmission
3872  Audi RS7 2015-2019 Sportback Performance    Automatic

In [54]:
#  tell me the year of the car in which transmission is manual.
df[df['transmission'] == 'Manual'][['year','transmission']].head(5)

   year transmission
0  2007       Manual
1  2007       Manual
2  2012       Manual
3  2017       Manual
4  2014       Manual

In [50]:
df.shape

(4340, 8)